# Ejercicios Intro Pandas

![imagen](img/ejercicios.png)

## Ejercicio 1
Importa el módulo `pandas` y el módulo `numpy`.

In [1]:
import numpy as np
import pandas as pd

## Ejercicio 2

Define una lista de 10 elementos y crea con ella un objeto `pandas.Series`.

In [7]:
lst=[i**2+2. for i in range(10)]

lst

[2.0, 3.0, 6.0, 11.0, 18.0, 27.0, 38.0, 51.0, 66.0, 83.0]

In [8]:
serie = pd.Series(lst)

serie

0     2.0
1     3.0
2     6.0
3    11.0
4    18.0
5    27.0
6    38.0
7    51.0
8    66.0
9    83.0
dtype: float64

## Ejercicio 3

Usa los índices para devolver el cuarto valor de la serie anterior.

*Recuerda que los índices en Python empiezan en 0.*

In [9]:
serie[3]

11.0

## Ejercicio 4

Define un `numpy.ndarray` de dimensiones (10, 5) y crea con él un `pandas.DataFrame`.

In [10]:
array = np.random.random((10, 5))

array

array([[0.17918023, 0.50452502, 0.9945287 , 0.69957231, 0.82367098],
       [0.74190478, 0.05704472, 0.67469769, 0.60495196, 0.51030468],
       [0.55504356, 0.99876732, 0.38611739, 0.25348095, 0.620555  ],
       [0.16141535, 0.59174504, 0.751951  , 0.05335711, 0.06823953],
       [0.48771001, 0.99736196, 0.0181214 , 0.17945455, 0.69093502],
       [0.44843173, 0.02016562, 0.29823007, 0.45184755, 0.94589282],
       [0.13216007, 0.7708588 , 0.03455161, 0.0131782 , 0.82266579],
       [0.05444602, 0.45264938, 0.52338598, 0.73820147, 0.67511938],
       [0.65945806, 0.23683834, 0.82652179, 0.98446542, 0.23276022],
       [0.36589125, 0.99394518, 0.68627542, 0.31043719, 0.65745993]])

In [11]:
type(array)

numpy.ndarray

In [12]:
df = pd.DataFrame(array)

df

          0         1         2         3         4
0  0.179180  0.504525  0.994529  0.699572  0.823671
1  0.741905  0.057045  0.674698  0.604952  0.510305
2  0.555044  0.998767  0.386117  0.253481  0.620555
3  0.161415  0.591745  0.751951  0.053357  0.068240
4  0.487710  0.997362  0.018121  0.179455  0.690935
5  0.448432  0.020166  0.298230  0.451848  0.945893
6  0.132160  0.770859  0.034552  0.013178  0.822666
7  0.054446  0.452649  0.523386  0.738201  0.675119
8  0.659458  0.236838  0.826522  0.984465  0.232760
9  0.365891  0.993945  0.686275  0.310437  0.657460

## Ejercicio 5

Renombra las columnas con la siguiente lista:

In [13]:
columns = ['Rate_1', 'Rate_2', 'Rate_3', 'Rate_4', 'Rate_5']

In [14]:
df.columns = columns

df

     Rate_1    Rate_2    Rate_3    Rate_4    Rate_5
0  0.179180  0.504525  0.994529  0.699572  0.823671
1  0.741905  0.057045  0.674698  0.604952  0.510305
2  0.555044  0.998767  0.386117  0.253481  0.620555
3  0.161415  0.591745  0.751951  0.053357  0.068240
4  0.487710  0.997362  0.018121  0.179455  0.690935
5  0.448432  0.020166  0.298230  0.451848  0.945893
6  0.132160  0.770859  0.034552  0.013178  0.822666
7  0.054446  0.452649  0.523386  0.738201  0.675119
8  0.659458  0.236838  0.826522  0.984465  0.232760
9  0.365891  0.993945  0.686275  0.310437  0.657460

## Ejercicio 6

Crea un subconjunto del dataframe que contenga las columnas `Rate_1`, `Rate_3` y `Rate_5`.

In [15]:
df[['Rate_1', 'Rate_3', 'Rate_5']]

     Rate_1    Rate_3    Rate_5
0  0.179180  0.994529  0.823671
1  0.741905  0.674698  0.510305
2  0.555044  0.386117  0.620555
3  0.161415  0.751951  0.068240
4  0.487710  0.018121  0.690935
5  0.448432  0.298230  0.945893
6  0.132160  0.034552  0.822666
7  0.054446  0.523386  0.675119
8  0.659458  0.826522  0.232760
9  0.365891  0.686275  0.657460

In [17]:
df.loc[:, ['Rate_1', 'Rate_3', 'Rate_5']]

     Rate_1    Rate_3    Rate_5
0  0.179180  0.994529  0.823671
1  0.741905  0.674698  0.510305
2  0.555044  0.386117  0.620555
3  0.161415  0.751951  0.068240
4  0.487710  0.018121  0.690935
5  0.448432  0.298230  0.945893
6  0.132160  0.034552  0.822666
7  0.054446  0.523386  0.675119
8  0.659458  0.826522  0.232760
9  0.365891  0.686275  0.657460

## Ejercicio 7

Crea un subconjunto del dataframe que contenga las filas pares.

In [21]:
df.iloc[::2]  # df.iloc[start:stop:step]

     Rate_1    Rate_2    Rate_3    Rate_4    Rate_5
0  0.179180  0.504525  0.994529  0.699572  0.823671
2  0.555044  0.998767  0.386117  0.253481  0.620555
4  0.487710  0.997362  0.018121  0.179455  0.690935
6  0.132160  0.770859  0.034552  0.013178  0.822666
8  0.659458  0.236838  0.826522  0.984465  0.232760

## Ejercicio 8

Calcula la media de la columna `Rate_4`.

In [23]:
df['Rate_4'].mean()

0.42889467129495423

## Ejercicio 8

Calcula la mediana de la columna `Rate_1`.

In [24]:
df['Rate_1'].median()

0.4071614918166174

## Ejercicio 9

Calcula el mínimo de la columna `Rate_2`.

In [25]:
df['Rate_2'].min()

0.020165615215331778

## Ejercicio 10

Calcula el máximo de la columna `Rate_5`.

In [26]:
df['Rate_5'].max()

0.9458928222918034

## Ejercicio 11

Crea un `pandas.DataFrame` con el siguiente diccionario:

In [28]:
products = {'Desc': ['Lunch bag', 'Vintage leaf cake cases', 'Ribbon reel stripes','Gliders', 'Playing cards',
                     'Popcorn holder', 'Alphabet blocks', 'Party bunting', 'Color Pen', 'Paint book'],
           'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
           'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
           'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [29]:
df_dic=pd.DataFrame(products)

df_dic

                      Desc  Quantity  UnitPrice  Revenue
0                Lunch bag         1       1.65     1.65
1  Vintage leaf cake cases        24       0.55    13.20
2      Ribbon reel stripes         1       1.65     1.65
3                  Gliders      2880       0.18   518.40
4            Playing cards         2       1.25     2.50
5           Popcorn holder         7       0.85     5.95
6          Alphabet blocks         1      11.95    11.95
7            Party bunting         4       4.95    19.80
8                Color Pen        10       0.19     1.90
9               Paint book        48       1.25    60.00

## Ejercicio 12

Calcula la cantidad (`Quantity`) y beneficio (`Revenue`) totales.

In [30]:
df_dic['Quantity'].sum()

2978

In [31]:
df_dic['Revenue'].sum()

637.0

## Ejercicio 13

¿Cuál es el producto más caro?. ¿El más barato?. ¿Y el más vendido?

In [58]:
df_dic['Desc'][df_dic['UnitPrice']==df_dic['UnitPrice'].max()]

6    Alphabet blocks
Name: Desc, dtype: object

In [54]:
type(df_dic['Desc'][df_dic['UnitPrice']==df_dic['UnitPrice'].max()])

pandas.core.series.Series

In [53]:
df_dic.loc[df_dic['UnitPrice'].idxmax(), 'Desc']

'Alphabet blocks'

In [55]:
type(df_dic.loc[df_dic['UnitPrice'].idxmax(), 'Desc'])

str

In [44]:
df_dic[df_dic['UnitPrice']==df_dic['UnitPrice'].min()]

      Desc  Quantity  UnitPrice  Revenue
3  Gliders      2880       0.18    518.4

In [45]:
df_dic[df_dic['Quantity']==df_dic['Quantity'].max()]

      Desc  Quantity  UnitPrice  Revenue
3  Gliders      2880       0.18    518.4

In [60]:
df.index=[i for i in range(0, 2*len(df), 2)]

In [71]:
for i in range(len(df)):
    try:
        print(df.loc[i])
    except:
        print('no')

Rate_1    0.179180
Rate_2    0.504525
Rate_3    0.994529
Rate_4    0.699572
Rate_5    0.823671
Name: 0, dtype: float64
no
Rate_1    0.741905
Rate_2    0.057045
Rate_3    0.674698
Rate_4    0.604952
Rate_5    0.510305
Name: 2, dtype: float64
no
Rate_1    0.555044
Rate_2    0.998767
Rate_3    0.386117
Rate_4    0.253481
Rate_5    0.620555
Name: 4, dtype: float64
no
Rate_1    0.161415
Rate_2    0.591745
Rate_3    0.751951
Rate_4    0.053357
Rate_5    0.068240
Name: 6, dtype: float64
no
Rate_1    0.487710
Rate_2    0.997362
Rate_3    0.018121
Rate_4    0.179455
Rate_5    0.690935
Name: 8, dtype: float64
no

In [69]:
df.loc[0]

Rate_1    0.179180
Rate_2    0.504525
Rate_3    0.994529
Rate_4    0.699572
Rate_5    0.823671
Name: 0, dtype: float64